Autodesk.Revit.DB.FamilyThermalProperties.Find(Autodesk.Revit.DB.Document,System.String)
Finds the thermal properties by the 'id' property of a constructionType node in Constructions.xml.
pADoc:
The document.
constructionId:
The 'id' property of a constructionType node in Constructions.xml
Returns:
The thermal properties found, or null if no match was found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013